simulation/openfoam/tjunction_2d_mill/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| Generated by gen_blockmesh.py — edit that script, not this file.            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1e-6;   // coordinates below are micrometres

vertices
(
    (-46000.0 0.0 0.0)   // 0
    (0.0 0.0 0.0)   // 1
    (0.0 400.0 0.0)   // 2
    (-46000.0 400.0 0.0)   // 3
    (-46000.0 0.0 400.0)   // 4
    (0.0 0.0 400.0)   // 5
    (0.0 400.0 400.0)   // 6
    (-46000.0 400.0 400.0)   // 7
    (2000.0 0.0 0.0)   // 8
    (2000.0 400.0 0.0)   // 9
    (2000.0 0.0 400.0)   // 10
    (2000.0 400.0 400.0)   // 11
    (2160.0 0.0 0.0)   // 12
    (2160.0 400.0 0.0)   // 13
    (2160.0 0.0 400.0)   // 14
    (2160.0 400.0 400.0)   // 15
    (2240.0 0.0 0.0)   // 16
    (2240.0 400.0 0.0)   // 17
    (2240.0 0.0 400.0)   // 18
    (2240.0 400.0 400.0)   // 19
    (2400.0 0.0 0.0)   // 20
    (2400.0 400.0 0.0)   // 21
    (2400.0 0.0 400.0)   // 22
    (2400.0 400.0 400.0)   // 23
    (6400.0 0.0 0.0)   // 24
    (6400.0 400.0 0.0)   // 25
    (6400.0 0.0 400.0)   // 26
    (6400.0 400.0 400.0)   // 27
    (2160.0 2400.0 0.0)   // 28
    (2000.0 2400.0 0.0)   // 29
    (2160.0 2400.0 400.0)   // 30
    (2000.0 2400.0 400.0)   // 31
    (2240.0 2400.0 0.0)   // 32
    (2240.0 2400.0 400.0)   // 33
    (2400.0 2400.0 0.0)   // 34
    (2400.0 2400.0 400.0)   // 35
    (2240.0 29400.0 0.0)   // 36
    (2160.0 29400.0 0.0)   // 37
    (2240.0 29400.0 400.0)   // 38
    (2160.0 29400.0 400.0)   // 39
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 20 1) simpleGrading (0.1 1 1)
    hex (1 8 9 2 5 10 11 6) (100 20 1) simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (8 20 1) simpleGrading (1 1 1)
    hex (12 16 17 13 14 18 19 15) (4 20 1) simpleGrading (1 1 1)
    hex (16 20 21 17 18 22 23 19) (8 20 1) simpleGrading (1 1 1)
    hex (20 24 25 21 22 26 27 23) (200 20 1) simpleGrading (1 1 1)
    hex (9 13 28 29 11 15 30 31) (8 40 1) simpleGrading (1 6 1)
    hex (13 17 32 28 15 19 33 30) (4 40 1) simpleGrading (1 6 1)
    hex (17 21 34 32 19 23 35 33) (8 40 1) simpleGrading (1 6 1)
    hex (28 32 36 37 30 33 38 39) (4 60 1) simpleGrading (1 12 1)
);

edges
(
);

boundary
(
    oil_inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    water_inlet
    {
        type patch;
        faces
        (
            (37 39 38 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (24 25 27 26)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
            (1 8 10 5)
            (2 6 11 9)
            (8 12 14 10)
            (12 16 18 14)
            (16 20 22 18)
            (20 24 26 22)
            (21 23 27 25)
            (9 11 31 29)
            (29 31 30 28)
            (21 34 35 23)
            (32 33 35 34)
            (28 30 39 37)
            (32 36 38 33)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
            (8 9 13 12)
            (10 14 15 11)
            (12 13 17 16)
            (14 18 19 15)
            (16 17 21 20)
            (18 22 23 19)
            (20 21 25 24)
            (22 26 27 23)
            (9 29 28 13)
            (11 15 30 31)
            (13 28 32 17)
            (15 19 33 30)
            (17 32 34 21)
            (19 23 35 33)
            (28 37 36 32)
            (30 33 38 39)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
