simulation/openfoam/tjunction_2d_mill/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Microfluidic flows are laminar (Re << 1 typically)
// Reynolds number ~ rho * U * D / mu ~ 1000 * 0.01 * 150e-6 / 0.001 ~ 1.5

simulationType  laminar;

// ************************************************************************* //


